<details><summary>Show Plan</summary>

```

terraform
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
module.database_cluster.random_password.master_password[0]: Refreshing state... [id=none]
data.github_release.latest_release: Reading...
module.database_cluster.random_id.snapshot_identifier[0]: Refreshing state... [id=g8r2jg]
data.github_release.latest_release: Read complete after 0s [id=84796488]
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging-push_logs]
module.database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03d2024cd76f87de7]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cf37ffc0ce81b1aa]
module.ecs.aws_iam_policy.fetch_ghcr_secret: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging-push-fetch-ghcr-secret]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/511c1c1e-eace-4166-b7c1-9bbfc82c70f6]
data.aws_ecr_repository.repository: Reading...
aws_secretsmanager_secret.ghcr_authentication: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-push-ghcr-auth-OvgPS5]
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.database_cluster.data.aws_partition.current: Reading...
module.database_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-9d5a7caf-e591-4fc3-9b8b-395ecc554a78]
module.ecs.data.aws_iam_policy_document.otel: Reading...
module.ecs.data.aws_iam_policy_document.otel: Read complete after 0s [id=1623705645]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging-push-ecs-task-execution-role]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging-push]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 0s [id=Z04987691W18X63LDNXVM]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_fetch_ghcr_secret_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221202100457139600000001]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310626000000005]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310513400000004]
data.aws_ecr_repository.repository: Read complete after 0s [id=echo-server]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_xray_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310311900000003]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310106100000002]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z04987691W18X63LDNXVM__9407f2eddc416d7cd8c8ee599f0a5c6a.staging.echo.walletconnect.com._CNAME]
module.database_cluster.aws_security_group.this[0]: Refreshing state... [id=sg-0e16ed5ca4c08ad1f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dabd56e1ee9f13d5]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-push-target-group/4e313fa6a28675a6]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-070f71778957ad172]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-096e43f33feb7bad8]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0481f853db59b18ab]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00c3da4dd2356a722]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-020d4227523193719]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0237d5132685aec74]
module.ecs.aws_security_group.lb_ingress: Refreshing state... [id=sg-09a393bfda92ce73c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01b56529aabb62ca4]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-030e538b0cb0a6d8e]
module.ecs.aws_security_group.app_ingress: Refreshing state... [id=sg-0204db9e1b9eeeade]
module.database_cluster.aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-804588316]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00ddd51caea6541c4]
module.database_cluster.aws_db_subnet_group.this[0]: Refreshing state... [id=staging-push-database]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-03e6492222243f584]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-061e6ac209de357b8]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f4d707d2387daf8d]
module.ecs.aws_lb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-push-load-balancer/aea5ef9d0a34453a]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07621fa7fde207073]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-089e0e3b3a4cf63c2]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0210fd7627e6a6303]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01b56529aabb62ca41080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-070f71778957ad1721080289494]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z04987691W18X63LDNXVM_staging.echo.walletconnect.com_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/171b42a3340fa814]
module.ecs.aws_lb_listener.listener-http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/b671fd955200d192]
module.database_cluster.aws_rds_cluster.this[0]: Refreshing state... [id=staging-push-database]
module.database_cluster.aws_rds_cluster_instance.this["1"]: Refreshing state... [id=staging-push-database-1]
module.ecs.aws_ecs_task_definition.app_task_definition: Refreshing state... [id=staging-push]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_secretsmanager_secret.ghcr_authentication will be destroyed
  # (because aws_secretsmanager_secret.ghcr_authentication is not in configuration)
  - resource "aws_secretsmanager_secret" "ghcr_authentication" {
      - arn                            = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-push-ghcr-auth-OvgPS5" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-push-ghcr-auth-OvgPS5" -> null
      - name                           = "staging-push-ghcr-auth" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Application"      = "push"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "push"
          - "ProvisionedBy"    = "Terraform"
        } -> null
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service"
        name                               = "staging-push-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:15" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:15" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging-push" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 15 -> (known after apply)
      - tags                     = {} -> null
      ~ task_role_arn            = "" -> "arn:aws:iam::898587786287:role/staging-push-ecs-task-execution-role" # forces replacement
        # (8 unchanged attributes hidden)

      ~ runtime_platform {
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_iam_policy.fetch_ghcr_secret will be destroyed
  # (because aws_iam_policy.fetch_ghcr_secret is not in configuration)
  - resource "aws_iam_policy" "fetch_ghcr_secret" {
      - arn       = "arn:aws:iam::898587786287:policy/staging-push-fetch-ghcr-secret" -> null
      - id        = "arn:aws:iam::898587786287:policy/staging-push-fetch-ghcr-secret" -> null
      - name      = "staging-push-fetch-ghcr-secret" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "secretsmanager:GetSecretValue",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-push-ghcr-auth-OvgPS5",
                          - "arn:aws:kms:eu-central-1:898587786287:key/key_id",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA5COABPQX4GVKTEOO3" -> null
      - tags      = {} -> null
      - tags_all  = {
          - "Application"      = "push"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "push"
          - "ProvisionedBy"    = "Terraform"
        } -> null
    }

  # module.ecs.aws_iam_policy.otel will be created
  + resource "aws_iam_policy" "otel" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "staging-push-otel"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                          + "ssm:GetParameters",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_fetch_ghcr_secret_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs_task_execution_fetch_ghcr_secret_policy" {
      ~ id         = "staging-push-ecs-task-execution-role-20221202100457139600000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::898587786287:policy/staging-push-fetch-ghcr-secret" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_iam_role_policy_attachment.ssm_read_only_policy will be created
  + resource "aws_iam_role_policy_attachment" "ssm_read_only_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
      + role       = "staging-push-ecs-task-execution-role"
    }

Plan: 4 to add, 1 to change, 4 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 5, in provider "aws":
   5:   skip_get_ec2_platforms      = true

With the retirement of EC2-Classic the skip_get_ec2_platforms attribute has
been deprecated and will be removed in a future version.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 5, in provider "aws":
   5:   skip_get_ec2_platforms      = true

With the retirement of EC2-Classic the skip_get_ec2_platforms attribute has
been deprecated and will be removed in a future version.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*